[
{
    "id": "s2v8",
    "name": "Shelf 2, Volume 8",
    "source": [
			{
				"name": "Design Document",
				"link": "https://docs.google.com/document/d/1ifxRX9fC213M-o9QqKDZpydLWSAv1_2vdhHodwGLI3I/edit?usp=sharing"
			}
		],
    "preview": [
			"Shelf 2, Volume 8 est un projet de jeu de type hack&slash en 2D basé sur des mécaniques de coordination.",
			"Le joueur peut contrôler plusieurs personnages simultanément pour effectuer des combos."
		],
    "desc": [
			"C'est avec ce projet que je suis rentré pour la première fois dans le monde du jeu vidéo.",
			"<i>Shelf 2, Volume 8</i> est un jeu en 2D, avec des mécaniques de combat complexes, j'ai donc dû passer par une phase de game design pour définir précisément ces mécaniques de jeu.",
			"<br> Ce projet m'a introduit au monde du jeu vidéo, et m'a permis d'apprendre les méthodes de conception de jeux.",
			"C'est après avoir découvert ces méthodes de travail que j'ai décidé de réaliser un projet de taille plus réduite avant celui-ci.",
			"J'ai donc fait une pause dans la conception de ce jeu pour plutôt concevoir <i>Wall 5</i>.",
			"<br> <i>Shelf 2, Volume 8</i> a été le projet qui a confirmé que le domaine du game dev et du game design est définitivement le domaine de l'informatique qui m'intéresse le plus."

		],
    "techs": ["csharp", "unity"]
},




{
    "id": "w2",
    "name": "Wall 2",
    "source": [
			{
				"name": "Design Document",
				"link": "https://docs.google.com/document/d/1N-jqkKdLSF-LnV_zXfiXsnERvm2czc-wGfuHvRmiRkc/edit?usp=sharing"
			}
		],
    "preview": [
			"Wall 2 est un projet de jeu destiné à être une introduction à l'histoire et aux mécaniques de Shelf 2, Volume 8.",
			"Ce jeu est pour moi aussi une introduction au game developement et à l'utilisation du moteur Unity"
		],
    "desc": [
			"J'ai entrepris de réaliser ce projet durant la conception de <i>Shelf 2, Volume 8</i>, car ce dernier est un projet ambitieux, qui nécessite d'avoir déjà une certaine expérience dans le domaine du développement de jeux.",
			"J'ai donc décidé de réaliser <i>Wall 2</i>, un jeu de taille réduite, qui me sert d'entraînement, et qui me permet d'apprendre l'utilisation du moteur de jeu Unity.",
			"De plus, ce jeu est une occasion de créer une introduction à l'histoire de <i>Shelf 2, Volume 8</i>.",
			"<br> Ce projet me permet donc de me familiariser avec Unity, mais aussi avec la rédaction d'un GDD (Game Design Document), un document résumant la conception et les choix techniques et artistiques du jeu."
		],
    "techs": ["csharp", "unity"]
},




{
    "id": "rkmEditor",
    "name": "RKM Editor",
    "source": [],
    "preview": [
			"Le RKM Editor est un logiciel développé au sein du laboratoire G-SCOP.",
			"Il permet de modéliser les connaissances sous forme d'un graphe appelé un RKM."
		],
    "desc": [
			"Durant mon stage de 2ème année de BUT informatique, j'ai rejoint le laboratoire G-SCOP.",
			"Ce laboratoire développe de nouvelles méthodes de production en respectant une vision environnementale et de sobriété énergétique.",
			"<br> Durant ce stage, j'ai travaillé sur le RKM Editor, un logiciel permettant de modéliser la connaissance sous forme d'un graphe appelé un RKM.",
			"Le logiciel est destiné aux chercheurs du laboratoire, pour modéliser les processus de fabrication, mais aussi a d'autres entreprises, qui peuvent l'utiliser comme un outil d'aide à la décision.",
			"Le RKM Editor est développé en C++ avec la bibliothèque graphique Qt.",
			"<br> Durant le stage, j'ai travaillé seul sur le projet, des réunions fréquentes étaient faites pour discuter de l'avancement du développement, et pour proposer différentes améliorations possibles.",
			"<br> J'ai pu découvrir que le code de l'application d'origine était très désorganisé et ne suivait pas d'architecture claire.",
			"Il a donc été nécessaire de refactoriser le logiciel entièrement pour rendre le code maintenable, ce qui m'a permis ensuite d'ajouter des fonctionnalités qui n'auraient pas été possibles précédemment.",
			"<br> Ce stage m'a permis de grandement renforcer mes compétences en C++, mais aussi en architecture logicielle et en refactorisation d'un code legacy.",
			"La qualité de code est une compétence qui a été largement mise en jeu durant la réalisation de ce projet, pour garder un code maintenable."
		],
    "techs": ["cpp", "qt"]
},




{
    "id": "ludimap",
    "name": "Ludi-Map",
    "source": [
			{
				"name": "Code Source",
				"link": "https://github.com/Exaether/Ludi-map"
			}
		],
    "preview": [
			"Ludi-Map est un jeu interactif en ligne avec des cartes anciennes pour mettre en valeur la géographie et les monuments de notre région.",
			"Ce site a été développé dans le cadre de la SAE du semestre 3 du BUT informatique."
		],
    "desc": [
			"Dans le cadre de la SAE du semestre 3 du BUT informatique, nous devions développer un site web mettant en valeur le patrimoine français.",
			"C'est dans ce contexte que mon équipe a développé Ludi-Map, un jeu interactif présentant des cartes de l'état-major des années 1820-1866.",
			"Les règles du jeu sont les suivantes :",
			"Un monument historique est choisi au hasard, et il est affiché sur une photo aérienne.",
			"Le joueur doit alors retrouver ce même monument, mais cette fois sur une carte des années 1820.",
			"L'objectif de ce jeu est de présenter au joueur les différents monuments de notre région, ainsi que les paysages et la géographie environnante.",
			"<br> Ludi-Map a été développé principalement en PHP et en JavaScript, ainsi que du HTML/CSS pour les interfaces. L'hébergement du serveur a été fait grâce à des machines virtuelles mises à disposition par l'IUT.",
			"Pour le développement de ce site, j'ai fait partie d'une équipe de 6 personnes. Mon rôle dans cette équipe était principalement axé sur la partie back-end du site.",
			"J'ai aussi joué le rôle de support aux différents membres du groupe, j'ai donc passé du temps à aider chacun d'entre eux à régler différents problèmes.",
			"Ce projet m'a permis d'approfondir mes compétences dans les technologies web telles que PHP et JavaScript. J'ai aussi pu améliorer mes compétences de gestion de projet et de travail en groupe, puisque'une grande partie de cette SAE y était consacrée."
		],
    "techs": ["php", "js", "html", "css"]
},




{
    "id": "cellular",
    "name": "Cellular automaton engine",
    "source": [
			{
				"name": "Code Source",
				"link": "https://github.com/Exaether/Cellular-automaton"
			}
		],
    "preview": [
			"Un simulateur d'automate cellulaire écrit en python.",
			"Le programme permet de simuler les règles d'un automate cellulaire, notamment le jeu de la vie."
		],
    "desc": [
			"Dans le cadre de mon apprentissage personnel du langage Python et de la bibliothèque Pygame, j'ai réalisé ce moteur du jeu de la vie.",
			"Il s'agit d'un programme entièrement écrit en python permettant de simuler un automate cellulaire, incluant le jeu de la vie, mais sans y être limité.",
			"<br> Un automate cellulaire est un ensemble de cellules qui évoluent génération après génération sur une grille selon certaines règles.",
			"Il faut donc recalculer l'état de chaque cellule à chaque génération.",
			"Le programme permet entre autres de :",
			"<ul> <li> Choisir un set de règles </li> <li> Créer un set de règles </li> <li> Modifier manuellement l'état de chaque cellule </li> </ul>",
			"Ce projet était initialement prévu pour servir d'apprentissage de la bibliothèque Pygame, mais le résultat final étant satisfaisant, il est resté comme un de mes projets principaux.",
			"N'ayant travaillé que seul sur ce projet, je n'ai mis en place aucune méthode d'organisation, bien que j'ai utilisé Git afin de sauvegarder mon travail.",
			"J'ai tout de même été contraint par un temps limité pour la réalisation de ce projet.",
			"<br> Lors de ce projet, j'ai principalement acquis des compétences techniques, comme une meilleure maîtrise du langage Python, et un apprentissage de la bibliothèque Pygame.",
			"C'est aussi un des premiers programmes de taille conséquente que j'ai conçu, j'ai donc dû adopter des bonnes pratiques de programmation, telles que commenter le code et respecter les <a href=\"https://peps.python.org/pep-0008/\">PEP</a> (Python Enhancement Proposals).",
			"<br> Enfin, j'ai apprécié ce projet principalement pour le fait de coder sans connaissance avancée de la bibliothèque, ce qui m'a obligé à me documenter pour réaliser ce programme."
		],
    "techs": ["Python", "Pygame"]
},




{
    "id": "dotfiles",
    "name": "Dotfiles",
    "source": [
			{
				"name": "Code Source",
				"link": "https://github.com/Exaether/dotfiles"
			}
		],
    "preview": [
			"<h3 style=\"margin-top: 0;\">\"I use Arch btw\"</h3>",
			"J'ai installé et configuré Arch Linux sur mon ordinateur personnel.",
			"J'ai donc commencé ce projet avec un écran noir et une ligne de commande. J'ai maintenant un environnement de bureau entièrement fonctionnel, optimisé et personnalisé."
	],
    "desc": [
			"<h3 style=\"margin-top: 0;\">\"I use Arch btw\"</h3>",
			"Arch Linux est une distribution Linux minimale qui a pour principe de n'inclure que le strict nécessaire au fonctionnement de l'ordinateur.",
			"Je suis donc libre d'inclure tous les logiciels dont j'ai besoin, tout en gardant un grand contrôle sur mon système.",
			"<br> Le terme \"dotfiles\" fait référence aux fichiers de configuration des logiciels installés, puisque leur nom commence en général par un point.",
			"Le processus de configuration de Arch passe par la modification d'un grand nombre de ces fichiers pour que chaque application obtienne le comportement désiré.",
			"J'ai principalement dû configurer les logiciels suivants :",
			"<ul> <li> i3 : pour l'environnement graphique </li> <li> polybar : pour obtenir une barre des tâches </li> <li> rofi : pour obtenir un menu de lancement d'applications </li> <li> zsh : pour une invite de commande personnalisée </li> <li> neoVim : un éditeur de texte avancé pour du code </li> </ul>",
			"<br> J'utilise Git pour stocker ces fichiers de configuration sur le cloud. De cette manière, je peux si besoin reproduire mon installation de Arch Linux rapidement sur un autre ordinateur.",
			"Ce projet m'a permis de compléter ma connaissance du fonctionnement de Linux, mais aussi du fonctionnement d'un ordinateur et d'un système d'exploitation en général.",
			"J'ai aussi découvert l'écosystème et la philosophie de Linux durant mes recherches pour des logiciels open-source.",
			"<br> Ce projet a été un de mes projets les plus importants puisqu'il m'a permis d'obtenir l'environnement de travail que j'utilise quotidiennement, ce qui me permet d'être bien plus efficace que dans un environnement pré-configuré comme windows ou KDE Plasma."
	],
    "techs": ["Linux", "Arch", "I3", "Polybar"]
},




{
    "id": "portfolio",
    "name": "Portfolio",
    "source": [
			{
				"name": "Code Source",
				"link": "https://github.com/Exaether/portfolio"
			}
		],
    "preview": [
			"Le site web sur lequel vous vous trouvez.",
			"Il présente ma personne, ainsi que tous les projets principaux que j'ai pu réaliser, mais aussi ceux en cours de réalisation."
		],
    "desc": [
			"Ceci est mon portfolio.<br>",
			"C'est le premier site web que j'ai pu réaliser, c'est donc avec lui que j'ai appris les différentes technologies web.",
			"Ce site a donc grandement évolué avec mon apprentissage des langages comme le JavaScript.",
			"Mon portfolio n'utilise pas de PHP, il est écrit entièrement en HTML et CSS, plus un script JavaScript qui permet de créer dynamiquement les cartes présentant mes projets, comme celle sur laquelle vous avez cliqué.",
			"Cela permet aussi de pouvoir publier ce site sur un serveur n'ayant pas accès à un interpréteur PHP, comme GitHub Pages.",
			"Le design du site est destiné à rester le plus sobre possible, pour que l'information présentée soit le centre d'intérêt principal du visiteur.",
			"<br> Bien qu'ayant été initié par ma formation, je continue de développer ce site web en tant que projet personnel.",
			"La réalisation de mon portfolio m'a principalement appris les fondamentaux des technologies web, principalement le HTML, CSS et JS.",
			"<br> Ce site porte une place spéciale parmi les différents projets web que j'ai pu réaliser, car il correspond à ma vision du web, étant une page simple ayant pour unique but de présenter une information."
		],
    "techs": ["html", "css", "js"]
},




{
    "id": "maze",
    "name": "Maze generator",
    "source": [
			{
				"name": "Code Source",
				"link": "https://github.com/Exaether/maze"
			}
		],
    "preview": [
			"Un projet de NSI dans lequel nous devions réaliser un programme permettant de générer un labyrinthe parfait.",
			"Ce projet est codé entièrement en python et utilise des structures de données complexes comme des arbres, piles, ou files."
		],
    "desc": [
			"Un projet de NSI dans lequel nous devions réaliser un programme permettant de générer un labyrinthe parfait.",
			"Un labyrinthe parfait est un labyrinthe dans lequel on peut accéder à n'importe quelle case depuis n'importe quelle case, et ce, par un seul et unique chemin.",
			"<br> Ce projet est codé entièrement en python et utilise des structures de données complexes comme des arbres, piles, ou files.",
			"Le projet étant proposé dans le cadre du cours portant sur les structures d'arbre, nous avons dû modéliser le labyrinthe à partir d'un arbre.",
			"Nous avons ensuite utilisé des piles et des files pour construire récursivement le labyrinthe de manière à ce qu'il soit parfait.",
			"<br> Après le rendu de ce projet en cours de NSI, j'ai décidé de le continuer en implémentant un affichage graphique utilisant Pygame, ainsi qu'un joueur déplaçable dans le labyrinthe.",
			"<br> J'ai donc travaillé dans un groupe de trois personnes durant la moitié de ce projet, de plus, la date de rendu était imposée.",
			"Nous avons donc mis en place une division des tâches, en se répartissant chacun un fichier du projet à coder.",
			"Nous n'avons toutefois pas utilisé Git pour cette partie du projet.",
			"<br> Dans la suite du projet, que j'ai réalisé seul, j'ai cette fois utilisé Git, mais pas d'autres méthodes d'organisation.",
			"Lors de ce projet, mon rôle a été d'écrire l'algorithme de génération du labyrinthe en lui-même. J'ai donc pu mettre en application les cours de NSI traitant des arbres, piles et files.",
			"J'ai pu aussi renforcer ma maîtrise du langage python ainsi que mes pratiques de programmation.",
			"<br> Lorsque j'ai repris le projet personnellement, j'ai dû utiliser Pygame, et j'ai donc renforcé ma connaissance de cette bibliothèque."
		],
    "techs": ["Python", "Pygame"]
}
]
